#什么是服务器
#在网络环境中，为用户提供一定资源或服务的应用软件，以及支撑此平台的高性能计算机

#IDC
#Internet Data Center 互联网数据中心

#服务器外形规格分类
#机架服务器
    #扁平式，标准宽度为19英寸
    #适合批量上架到机柜
#其他款式
    #塔式
    #刀片式、机柜式

#厚度及机柜尺寸
#机房设备厚度规格
    #1Unit=1.75英寸=4.445厘米
#服务器：1U、2U、4U
#机柜容量：18U、22U、37U、42U
    #网络机柜：深600、800mm
    #服务器机柜：深900、1000mm

#服务器选性参数
#CPU处理器
    #服务器能够支持的处理器个数
        #单路、双/两路、四路
    #处理器核心数/频率/缓存
        #4核、8核、16核、18核
        #2.4GHz、3.2GHz、3.5GHz
        #15MB、24MB、45MB
#内存
    #内存插槽数：8、12、16、24、48个
    #服务器支持最大内存容量（个）：64、128、192、768GB、1.5TB
#磁盘
    #磁盘尺寸及接口
        #2.5寸   2.5寸SAS接口、2.5寸SSD接口
        #3.5寸   3.5寸SATA接口
    #盘架个数：4、8、12、16个
    #服务器最大支持硬盘的容量（TB）4、8、12TB

#RAID阵列卡（廉价冗余磁盘阵列）
#支持阵列技术的类别
    #RAID0条带
    #RAID1镜像
    #RAID10复合
    #RAID5/6均衡
#类别         RAID0           RAID1           RAID10          RAID5           RAID6
#磁盘数       大于等于2        大于等于2        大于等于4       大于等于3        大于等于4
#空间利用率    100%            小于等于50%     小于等于50%      n-1/n           n-2/n
#校验盘        无              无              无              1               2
#读写速率      高              低              中              较高            较高       
















