#计算机木马
    #木马概述
        #具有欺骗性质、会导致受害者计算机的敏感信息泄露、被黑客控制等危害的隐蔽性程序
        #木马程序通常伪装/依附在一些工具软件、小游戏、图片、视频文件中，诱使用户打开以激活木马
    #木马程序演示
         #植入及启用过程
                    #配置木马       木马伪装、信息反馈
                    #传播木马       软件下载、邮件附件 淫秽图片、通信软件
                    #启动木马       自动启动、潜伏待命
                    #建立连接       主动连接、被动连接
                    #远程控制
            #病毒程序演示
                #黑客软件
                #大白鲨远程管理软件
                    #关闭黑客机的防火墙，肉鸡的防火墙可以不关
                    #配置程序
                        #IP为黑客IP
                        #端口默认8090
                        #勾选 不安装直接运行
                        #生成服务端  ——》 后缀exe 名字要伪装
                        #木马文件压缩 不然会被直接删除
            #肉鸡上查看8090端口 win+R CMD netstat -nao       
                #网络人  http://netman123.cn/download.shtml    
#计算机病毒
    #病毒概述
        #木马是为了操纵，病毒是为了破坏；
        #病毒以破坏为目的，比如删文件/拖网速/系统奔溃等，而不是窃取信息（木马）
        #可通过邮件/图片/视频/软件下载/光盘等途径进行传播
        #具有自我复制和感染能力
    #病毒程序演示
        #病毒程序好比进入计算机中电子流氓
        #明目张胆的破坏能力急剧危害性
        #例如：CIH病毒、冲击波、红色代码、熊猫烧香
#系统安全防御
    #防病毒/防木马软件
        #国内软件   360杀毒、360安全卫士、金山毒霸、瑞星
        #国外软件   卡巴斯基、麦克菲、诺顿
    #查杀病毒木马
    #安全攻防技术前瞻
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    


